Revit 2027 API
SpecTypeId.CrossSection Property
 Cross Section, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CrossSection { get; }
Public Shared ReadOnly Property CrossSection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CrossSection {
	ForgeTypeId^ get ();
}
static member CrossSection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace